Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/component/tram.h
#define TRAM_RAM1498_REG_OFST          _UINT32_(0x2768)    /* (TRAM_RAM1498) TrustRAM Offset */
#define TRAM_RAM1499_REG_OFST          _UINT32_(0x276C)    /* (TRAM_RAM1499) TrustRAM Offset */
#define TRAM_RAM1500_REG_OFST          _UINT32_(0x2770)    /* (TRAM_RAM1500) TrustRAM Offset */
#define TRAM_RAM1501_REG_OFST          _UINT32_(0x2774)    /* (TRAM_RAM1501) TrustRAM Offset */
#define TRAM_RAM1502_REG_OFST          _UINT32_(0x2778)    /* (TRAM_RAM1502) TrustRAM Offset */
#define TRAM_RAM1503_REG_OFST          _UINT32_(0x277C)    /* (TRAM_RAM1503) TrustRAM Offset */
#define TRAM_RAM1504_REG_OFST          _UINT32_(0x2780)    /* (TRAM_RAM1504) TrustRAM Offset */
#define TRAM_RAM1505_REG_OFST          _UINT32_(0x2784)    /* (TRAM_RAM1505) TrustRAM Offset */
#define TRAM_RAM1506_REG_OFST          _UINT32_(0x2788)    /* (TRAM_RAM1506) TrustRAM Offset */
#define TRAM_RAM1507_REG_OFST          _UINT32_(0x278C)    /* (TRAM_RAM1507) TrustRAM Offset */
#define TRAM_RAM1508_REG_OFST          _UINT32_(0x2790)    /* (TRAM_RAM1508) TrustRAM Offset */
#define TRAM_RAM1509_REG_OFST          _UINT32_(0x2794)    /* (TRAM_RAM1509) TrustRAM Offset */
#define TRAM_RAM1510_REG_OFST          _UINT32_(0x2798)    /* (TRAM_RAM1510) TrustRAM Offset */
#define TRAM_RAM1511_REG_OFST          _UINT32_(0x279C)    /* (TRAM_RAM1511) TrustRAM Offset */
#define TRAM_RAM1512_REG_OFST          _UINT32_(0x27A0)    /* (TRAM_RAM1512) TrustRAM Offset */
#define TRAM_RAM1513_REG_OFST          _UINT32_(0x27A4)    /* (TRAM_RAM1513) TrustRAM Offset */
#define TRAM_RAM1514_REG_OFST          _UINT32_(0x27A8)    /* (TRAM_RAM1514) TrustRAM Offset */
#define TRAM_RAM1515_REG_OFST          _UINT32_(0x27AC)    /* (TRAM_RAM1515) TrustRAM Offset */
#define TRAM_RAM1516_REG_OFST          _UINT32_(0x27B0)    /* (TRAM_RAM1516) TrustRAM Offset */
#define TRAM_RAM1517_REG_OFST          _UINT32_(0x27B4)    /* (TRAM_RAM1517) TrustRAM Offset */
#define TRAM_RAM1518_REG_OFST          _UINT32_(0x27B8)    /* (TRAM_RAM1518) TrustRAM Offset */
#define TRAM_RAM1519_REG_OFST          _UINT32_(0x27BC)    /* (TRAM_RAM1519) TrustRAM Offset */
#define TRAM_RAM1520_REG_OFST          _UINT32_(0x27C0)    /* (TRAM_RAM1520) TrustRAM Offset */
#define TRAM_RAM1521_REG_OFST          _UINT32_(0x27C4)    /* (TRAM_RAM1521) TrustRAM Offset */
#define TRAM_RAM1522_REG_OFST          _UINT32_(0x27C8)    /* (TRAM_RAM1522) TrustRAM Offset */
#define TRAM_RAM1523_REG_OFST          _UINT32_(0x27CC)    /* (TRAM_RAM1523) TrustRAM Offset */
#define TRAM_RAM1524_REG_OFST          _UINT32_(0x27D0)    /* (TRAM_RAM1524) TrustRAM Offset */
#define TRAM_RAM1525_REG_OFST          _UINT32_(0x27D4)    /* (TRAM_RAM1525) TrustRAM Offset */
#define TRAM_RAM1526_REG_OFST          _UINT32_(0x27D8)    /* (TRAM_RAM1526) TrustRAM Offset */
#define TRAM_RAM1527_REG_OFST          _UINT32_(0x27DC)    /* (TRAM_RAM1527) TrustRAM Offset */
#define TRAM_RAM1528_REG_OFST          _UINT32_(0x27E0)    /* (TRAM_RAM1528) TrustRAM Offset */
#define TRAM_RAM1529_REG_OFST          _UINT32_(0x27E4)    /* (TRAM_RAM1529) TrustRAM Offset */
#define TRAM_RAM1530_REG_OFST          _UINT32_(0x27E8)    /* (TRAM_RAM1530) TrustRAM Offset */
#define TRAM_RAM1531_REG_OFST          _UINT32_(0x27EC)    /* (TRAM_RAM1531) TrustRAM Offset */
#define TRAM_RAM1532_REG_OFST          _UINT32_(0x27F0)    /* (TRAM_RAM1532) TrustRAM Offset */
#define TRAM_RAM1533_REG_OFST          _UINT32_(0x27F4)    /* (TRAM_RAM1533) TrustRAM Offset */
#define TRAM_RAM1534_REG_OFST          _UINT32_(0x27F8)    /* (TRAM_RAM1534) TrustRAM Offset */
#define TRAM_RAM1535_REG_OFST          _UINT32_(0x27FC)    /* (TRAM_RAM1535) TrustRAM Offset */
#define TRAM_RAM1536_REG_OFST          _UINT32_(0x2800)    /* (TRAM_RAM1536) TrustRAM Offset */
#define TRAM_RAM1537_REG_OFST          _UINT32_(0x2804)    /* (TRAM_RAM1537) TrustRAM Offset */
#define TRAM_RAM1538_REG_OFST          _UINT32_(0x2808)    /* (TRAM_RAM1538) TrustRAM Offset */
#define TRAM_RAM1539_REG_OFST          _UINT32_(0x280C)    /* (TRAM_RAM1539) TrustRAM Offset */
#define TRAM_RAM1540_REG_OFST          _UINT32_(0x2810)    /* (TRAM_RAM1540) TrustRAM Offset */
#define TRAM_RAM1541_REG_OFST          _UINT32_(0x2814)    /* (TRAM_RAM1541) TrustRAM Offset */
#define TRAM_RAM1542_REG_OFST          _UINT32_(0x2818)    /* (TRAM_RAM1542) TrustRAM Offset */
#define TRAM_RAM1543_REG_OFST          _UINT32_(0x281C)    /* (TRAM_RAM1543) TrustRAM Offset */
#define TRAM_RAM1544_REG_OFST          _UINT32_(0x2820)    /* (TRAM_RAM1544) TrustRAM Offset */
#define TRAM_RAM1545_REG_OFST          _UINT32_(0x2824)    /* (TRAM_RAM1545) TrustRAM Offset */
#define TRAM_RAM1546_REG_OFST          _UINT32_(0x2828)    /* (TRAM_RAM1546) TrustRAM Offset */
#define TRAM_RAM1547_REG_OFST          _UINT32_(0x282C)    /* (TRAM_RAM1547) TrustRAM Offset */
#define TRAM_RAM1548_REG_OFST          _UINT32_(0x2830)    /* (TRAM_RAM1548) TrustRAM Offset */
#define TRAM_RAM1549_REG_OFST          _UINT32_(0x2834)    /* (TRAM_RAM1549) TrustRAM Offset */
#define TRAM_RAM1550_REG_OFST          _UINT32_(0x2838)    /* (TRAM_RAM1550) TrustRAM Offset */
#define TRAM_RAM1551_REG_OFST          _UINT32_(0x283C)    /* (TRAM_RAM1551) TrustRAM Offset */
#define TRAM_RAM1552_REG_OFST          _UINT32_(0x2840)    /* (TRAM_RAM1552) TrustRAM Offset */
#define TRAM_RAM1553_REG_OFST          _UINT32_(0x2844)    /* (TRAM_RAM1553) TrustRAM Offset */
#define TRAM_RAM1554_REG_OFST          _UINT32_(0x2848)    /* (TRAM_RAM1554) TrustRAM Offset */
#define TRAM_RAM1555_REG_OFST          _UINT32_(0x284C)    /* (TRAM_RAM1555) TrustRAM Offset */
#define TRAM_RAM1556_REG_OFST          _UINT32_(0x2850)    /* (TRAM_RAM1556) TrustRAM Offset */
#define TRAM_RAM1557_REG_OFST          _UINT32_(0x2854)    /* (TRAM_RAM1557) TrustRAM Offset */
#define TRAM_RAM1558_REG_OFST          _UINT32_(0x2858)    /* (TRAM_RAM1558) TrustRAM Offset */
#define TRAM_RAM1559_REG_OFST          _UINT32_(0x285C)    /* (TRAM_RAM1559) TrustRAM Offset */
#define TRAM_RAM1560_REG_OFST          _UINT32_(0x2860)    /* (TRAM_RAM1560) TrustRAM Offset */
#define TRAM_RAM1561_REG_OFST          _UINT32_(0x2864)    /* (TRAM_RAM1561) TrustRAM Offset */
#define TRAM_RAM1562_REG_OFST          _UINT32_(0x2868)    /* (TRAM_RAM1562) TrustRAM Offset */
#define TRAM_RAM1563_REG_OFST          _UINT32_(0x286C)    /* (TRAM_RAM1563) TrustRAM Offset */
#define TRAM_RAM1564_REG_OFST          _UINT32_(0x2870)    /* (TRAM_RAM1564) TrustRAM Offset */
#define TRAM_RAM1565_REG_OFST          _UINT32_(0x2874)    /* (TRAM_RAM1565) TrustRAM Offset */
#define TRAM_RAM1566_REG_OFST          _UINT32_(0x2878)    /* (TRAM_RAM1566) TrustRAM Offset */
#define TRAM_RAM1567_REG_OFST          _UINT32_(0x287C)    /* (TRAM_RAM1567) TrustRAM Offset */
#define TRAM_RAM1568_REG_OFST          _UINT32_(0x2880)    /* (TRAM_RAM1568) TrustRAM Offset */
#define TRAM_RAM1569_REG_OFST          _UINT32_(0x2884)    /* (TRAM_RAM1569) TrustRAM Offset */
#define TRAM_RAM1570_REG_OFST          _UINT32_(0x2888)    /* (TRAM_RAM1570) TrustRAM Offset */
#define TRAM_RAM1571_REG_OFST          _UINT32_(0x288C)    /* (TRAM_RAM1571) TrustRAM Offset */
#define TRAM_RAM1572_REG_OFST          _UINT32_(0x2890)    /* (TRAM_RAM1572) TrustRAM Offset */
#define TRAM_RAM1573_REG_OFST          _UINT32_(0x2894)    /* (TRAM_RAM1573) TrustRAM Offset */
#define TRAM_RAM1574_REG_OFST          _UINT32_(0x2898)    /* (TRAM_RAM1574) TrustRAM Offset */
#define TRAM_RAM1575_REG_OFST          _UINT32_(0x289C)    /* (TRAM_RAM1575) TrustRAM Offset */
#define TRAM_RAM1576_REG_OFST          _UINT32_(0x28A0)    /* (TRAM_RAM1576) TrustRAM Offset */
#define TRAM_RAM1577_REG_OFST          _UINT32_(0x28A4)    /* (TRAM_RAM1577) TrustRAM Offset */
#define TRAM_RAM1578_REG_OFST          _UINT32_(0x28A8)    /* (TRAM_RAM1578) TrustRAM Offset */
#define TRAM_RAM1579_REG_OFST          _UINT32_(0x28AC)    /* (TRAM_RAM1579) TrustRAM Offset */
#define TRAM_RAM1580_REG_OFST          _UINT32_(0x28B0)    /* (TRAM_RAM1580) TrustRAM Offset */
#define TRAM_RAM1581_REG_OFST          _UINT32_(0x28B4)    /* (TRAM_RAM1581) TrustRAM Offset */
#define TRAM_RAM1582_REG_OFST          _UINT32_(0x28B8)    /* (TRAM_RAM1582) TrustRAM Offset */
#define TRAM_RAM1583_REG_OFST          _UINT32_(0x28BC)    /* (TRAM_RAM1583) TrustRAM Offset */
#define TRAM_RAM1584_REG_OFST          _UINT32_(0x28C0)    /* (TRAM_RAM1584) TrustRAM Offset */
#define TRAM_RAM1585_REG_OFST          _UINT32_(0x28C4)    /* (TRAM_RAM1585) TrustRAM Offset */
#define TRAM_RAM1586_REG_OFST          _UINT32_(0x28C8)    /* (TRAM_RAM1586) TrustRAM Offset */
#define TRAM_RAM1587_REG_OFST          _UINT32_(0x28CC)    /* (TRAM_RAM1587) TrustRAM Offset */
#define TRAM_RAM1588_REG_OFST          _UINT32_(0x28D0)    /* (TRAM_RAM1588) TrustRAM Offset */
#define TRAM_RAM1589_REG_OFST          _UINT32_(0x28D4)    /* (TRAM_RAM1589) TrustRAM Offset */
#define TRAM_RAM1590_REG_OFST          _UINT32_(0x28D8)    /* (TRAM_RAM1590) TrustRAM Offset */
#define TRAM_RAM1591_REG_OFST          _UINT32_(0x28DC)    /* (TRAM_RAM1591) TrustRAM Offset */
#define TRAM_RAM1592_REG_OFST          _UINT32_(0x28E0)    /* (TRAM_RAM1592) TrustRAM Offset */
#define TRAM_RAM1593_REG_OFST          _UINT32_(0x28E4)    /* (TRAM_RAM1593) TrustRAM Offset */
#define TRAM_RAM1594_REG_OFST          _UINT32_(0x28E8)    /* (TRAM_RAM1594) TrustRAM Offset */
#define TRAM_RAM1595_REG_OFST          _UINT32_(0x28EC)    /* (TRAM_RAM1595) TrustRAM Offset */
#define TRAM_RAM1596_REG_OFST          _UINT32_(0x28F0)    /* (TRAM_RAM1596) TrustRAM Offset */
#define TRAM_RAM1597_REG_OFST          _UINT32_(0x28F4)    /* (TRAM_RAM1597) TrustRAM Offset */
#define TRAM_RAM1598_REG_OFST          _UINT32_(0x28F8)    /* (TRAM_RAM1598) TrustRAM Offset */
#define TRAM_RAM1599_REG_OFST          _UINT32_(0x28FC)    /* (TRAM_RAM1599) TrustRAM Offset */
#define TRAM_RAM1600_REG_OFST          _UINT32_(0x2900)    /* (TRAM_RAM1600) TrustRAM Offset */
#define TRAM_RAM1601_REG_OFST          _UINT32_(0x2904)    /* (TRAM_RAM1601) TrustRAM Offset */
#define TRAM_RAM1602_REG_OFST          _UINT32_(0x2908)    /* (TRAM_RAM1602) TrustRAM Offset */
#define TRAM_RAM1603_REG_OFST          _UINT32_(0x290C)    /* (TRAM_RAM1603) TrustRAM Offset */
#define TRAM_RAM1604_REG_OFST          _UINT32_(0x2910)    /* (TRAM_RAM1604) TrustRAM Offset */
#define TRAM_RAM1605_REG_OFST          _UINT32_(0x2914)    /* (TRAM_RAM1605) TrustRAM Offset */
#define TRAM_RAM1606_REG_OFST          _UINT32_(0x2918)    /* (TRAM_RAM1606) TrustRAM Offset */
#define TRAM_RAM1607_REG_OFST          _UINT32_(0x291C)    /* (TRAM_RAM1607) TrustRAM Offset */
#define TRAM_RAM1608_REG_OFST          _UINT32_(0x2920)    /* (TRAM_RAM1608) TrustRAM Offset */
#define TRAM_RAM1609_REG_OFST          _UINT32_(0x2924)    /* (TRAM_RAM1609) TrustRAM Offset */
#define TRAM_RAM1610_REG_OFST          _UINT32_(0x2928)    /* (TRAM_RAM1610) TrustRAM Offset */
#define TRAM_RAM1611_REG_OFST          _UINT32_(0x292C)    /* (TRAM_RAM1611) TrustRAM Offset */
#define TRAM_RAM1612_REG_OFST          _UINT32_(0x2930)    /* (TRAM_RAM1612) TrustRAM Offset */
#define TRAM_RAM1613_REG_OFST          _UINT32_(0x2934)    /* (TRAM_RAM1613) TrustRAM Offset */
#define TRAM_RAM1614_REG_OFST          _UINT32_(0x2938)    /* (TRAM_RAM1614) TrustRAM Offset */
#define TRAM_RAM1615_REG_OFST          _UINT32_(0x293C)    /* (TRAM_RAM1615) TrustRAM Offset */
#define TRAM_RAM1616_REG_OFST          _UINT32_(0x2940)    /* (TRAM_RAM1616) TrustRAM Offset */
#define TRAM_RAM1617_REG_OFST          _UINT32_(0x2944)    /* (TRAM_RAM1617) TrustRAM Offset */
#define TRAM_RAM1618_REG_OFST          _UINT32_(0x2948)    /* (TRAM_RAM1618) TrustRAM Offset */
#define TRAM_RAM1619_REG_OFST          _UINT32_(0x294C)    /* (TRAM_RAM1619) TrustRAM Offset */
#define TRAM_RAM1620_REG_OFST          _UINT32_(0x2950)    /* (TRAM_RAM1620) TrustRAM Offset */
#define TRAM_RAM1621_REG_OFST          _UINT32_(0x2954)    /* (TRAM_RAM1621) TrustRAM Offset */
#define TRAM_RAM1622_REG_OFST          _UINT32_(0x2958)    /* (TRAM_RAM1622) TrustRAM Offset */
#define TRAM_RAM1623_REG_OFST          _UINT32_(0x295C)    /* (TRAM_RAM1623) TrustRAM Offset */
#define TRAM_RAM1624_REG_OFST          _UINT32_(0x2960)    /* (TRAM_RAM1624) TrustRAM Offset */
#define TRAM_RAM1625_REG_OFST          _UINT32_(0x2964)    /* (TRAM_RAM1625) TrustRAM Offset */
#define TRAM_RAM1626_REG_OFST          _UINT32_(0x2968)    /* (TRAM_RAM1626) TrustRAM Offset */
#define TRAM_RAM1627_REG_OFST          _UINT32_(0x296C)    /* (TRAM_RAM1627) TrustRAM Offset */
#define TRAM_RAM1628_REG_OFST          _UINT32_(0x2970)    /* (TRAM_RAM1628) TrustRAM Offset */
#define TRAM_RAM1629_REG_OFST          _UINT32_(0x2974)    /* (TRAM_RAM1629) TrustRAM Offset */
#define TRAM_RAM1630_REG_OFST          _UINT32_(0x2978)    /* (TRAM_RAM1630) TrustRAM Offset */
#define TRAM_RAM1631_REG_OFST          _UINT32_(0x297C)    /* (TRAM_RAM1631) TrustRAM Offset */
#define TRAM_RAM1632_REG_OFST          _UINT32_(0x2980)    /* (TRAM_RAM1632) TrustRAM Offset */
#define TRAM_RAM1633_REG_OFST          _UINT32_(0x2984)    /* (TRAM_RAM1633) TrustRAM Offset */
#define TRAM_RAM1634_REG_OFST          _UINT32_(0x2988)    /* (TRAM_RAM1634) TrustRAM Offset */
#define TRAM_RAM1635_REG_OFST          _UINT32_(0x298C)    /* (TRAM_RAM1635) TrustRAM Offset */
#define TRAM_RAM1636_REG_OFST          _UINT32_(0x2990)    /* (TRAM_RAM1636) TrustRAM Offset */
#define TRAM_RAM1637_REG_OFST          _UINT32_(0x2994)    /* (TRAM_RAM1637) TrustRAM Offset */
#define TRAM_RAM1638_REG_OFST          _UINT32_(0x2998)    /* (TRAM_RAM1638) TrustRAM Offset */
#define TRAM_RAM1639_REG_OFST          _UINT32_(0x299C)    /* (TRAM_RAM1639) TrustRAM Offset */
#define TRAM_RAM1640_REG_OFST          _UINT32_(0x29A0)    /* (TRAM_RAM1640) TrustRAM Offset */
#define TRAM_RAM1641_REG_OFST          _UINT32_(0x29A4)    /* (TRAM_RAM1641) TrustRAM Offset */
#define TRAM_RAM1642_REG_OFST          _UINT32_(0x29A8)    /* (TRAM_RAM1642) TrustRAM Offset */
#define TRAM_RAM1643_REG_OFST          _UINT32_(0x29AC)    /* (TRAM_RAM1643) TrustRAM Offset */
#define TRAM_RAM1644_REG_OFST          _UINT32_(0x29B0)    /* (TRAM_RAM1644) TrustRAM Offset */
#define TRAM_RAM1645_REG_OFST          _UINT32_(0x29B4)    /* (TRAM_RAM1645) TrustRAM Offset */
#define TRAM_RAM1646_REG_OFST          _UINT32_(0x29B8)    /* (TRAM_RAM1646) TrustRAM Offset */
#define TRAM_RAM1647_REG_OFST          _UINT32_(0x29BC)    /* (TRAM_RAM1647) TrustRAM Offset */
#define TRAM_RAM1648_REG_OFST          _UINT32_(0x29C0)    /* (TRAM_RAM1648) TrustRAM Offset */
#define TRAM_RAM1649_REG_OFST          _UINT32_(0x29C4)    /* (TRAM_RAM1649) TrustRAM Offset */
#define TRAM_RAM1650_REG_OFST          _UINT32_(0x29C8)    /* (TRAM_RAM1650) TrustRAM Offset */
#define TRAM_RAM1651_REG_OFST          _UINT32_(0x29CC)    /* (TRAM_RAM1651) TrustRAM Offset */
#define TRAM_RAM1652_REG_OFST          _UINT32_(0x29D0)    /* (TRAM_RAM1652) TrustRAM Offset */
#define TRAM_RAM1653_REG_OFST          _UINT32_(0x29D4)    /* (TRAM_RAM1653) TrustRAM Offset */
#define TRAM_RAM1654_REG_OFST          _UINT32_(0x29D8)    /* (TRAM_RAM1654) TrustRAM Offset */
#define TRAM_RAM1655_REG_OFST          _UINT32_(0x29DC)    /* (TRAM_RAM1655) TrustRAM Offset */
#define TRAM_RAM1656_REG_OFST          _UINT32_(0x29E0)    /* (TRAM_RAM1656) TrustRAM Offset */
#define TRAM_RAM1657_REG_OFST          _UINT32_(0x29E4)    /* (TRAM_RAM1657) TrustRAM Offset */
#define TRAM_RAM1658_REG_OFST          _UINT32_(0x29E8)    /* (TRAM_RAM1658) TrustRAM Offset */
#define TRAM_RAM1659_REG_OFST          _UINT32_(0x29EC)    /* (TRAM_RAM1659) TrustRAM Offset */
#define TRAM_RAM1660_REG_OFST          _UINT32_(0x29F0)    /* (TRAM_RAM1660) TrustRAM Offset */
#define TRAM_RAM1661_REG_OFST          _UINT32_(0x29F4)    /* (TRAM_RAM1661) TrustRAM Offset */
#define TRAM_RAM1662_REG_OFST          _UINT32_(0x29F8)    /* (TRAM_RAM1662) TrustRAM Offset */
#define TRAM_RAM1663_REG_OFST          _UINT32_(0x29FC)    /* (TRAM_RAM1663) TrustRAM Offset */
#define TRAM_RAM1664_REG_OFST          _UINT32_(0x2A00)    /* (TRAM_RAM1664) TrustRAM Offset */
#define TRAM_RAM1665_REG_OFST          _UINT32_(0x2A04)    /* (TRAM_RAM1665) TrustRAM Offset */
#define TRAM_RAM1666_REG_OFST          _UINT32_(0x2A08)    /* (TRAM_RAM1666) TrustRAM Offset */
#define TRAM_RAM1667_REG_OFST          _UINT32_(0x2A0C)    /* (TRAM_RAM1667) TrustRAM Offset */
#define TRAM_RAM1668_REG_OFST          _UINT32_(0x2A10)    /* (TRAM_RAM1668) TrustRAM Offset */
#define TRAM_RAM1669_REG_OFST          _UINT32_(0x2A14)    /* (TRAM_RAM1669) TrustRAM Offset */
#define TRAM_RAM1670_REG_OFST          _UINT32_(0x2A18)    /* (TRAM_RAM1670) TrustRAM Offset */
#define TRAM_RAM1671_REG_OFST          _UINT32_(0x2A1C)    /* (TRAM_RAM1671) TrustRAM Offset */
#define TRAM_RAM1672_REG_OFST          _UINT32_(0x2A20)    /* (TRAM_RAM1672) TrustRAM Offset */
#define TRAM_RAM1673_REG_OFST          _UINT32_(0x2A24)    /* (TRAM_RAM1673) TrustRAM Offset */
#define TRAM_RAM1674_REG_OFST          _UINT32_(0x2A28)    /* (TRAM_RAM1674) TrustRAM Offset */
#define TRAM_RAM1675_REG_OFST          _UINT32_(0x2A2C)    /* (TRAM_RAM1675) TrustRAM Offset */
#define TRAM_RAM1676_REG_OFST          _UINT32_(0x2A30)    /* (TRAM_RAM1676) TrustRAM Offset */
#define TRAM_RAM1677_REG_OFST          _UINT32_(0x2A34)    /* (TRAM_RAM1677) TrustRAM Offset */
#define TRAM_RAM1678_REG_OFST          _UINT32_(0x2A38)    /* (TRAM_RAM1678) TrustRAM Offset */
#define TRAM_RAM1679_REG_OFST          _UINT32_(0x2A3C)    /* (TRAM_RAM1679) TrustRAM Offset */
#define TRAM_RAM1680_REG_OFST          _UINT32_(0x2A40)    /* (TRAM_RAM1680) TrustRAM Offset */
#define TRAM_RAM1681_REG_OFST          _UINT32_(0x2A44)    /* (TRAM_RAM1681) TrustRAM Offset */
#define TRAM_RAM1682_REG_OFST          _UINT32_(0x2A48)    /* (TRAM_RAM1682) TrustRAM Offset */
#define TRAM_RAM1683_REG_OFST          _UINT32_(0x2A4C)    /* (TRAM_RAM1683) TrustRAM Offset */
#define TRAM_RAM1684_REG_OFST          _UINT32_(0x2A50)    /* (TRAM_RAM1684) TrustRAM Offset */
#define TRAM_RAM1685_REG_OFST          _UINT32_(0x2A54)    /* (TRAM_RAM1685) TrustRAM Offset */
#define TRAM_RAM1686_REG_OFST          _UINT32_(0x2A58)    /* (TRAM_RAM1686) TrustRAM Offset */
#define TRAM_RAM1687_REG_OFST          _UINT32_(0x2A5C)    /* (TRAM_RAM1687) TrustRAM Offset */
#define TRAM_RAM1688_REG_OFST          _UINT32_(0x2A60)    /* (TRAM_RAM1688) TrustRAM Offset */
#define TRAM_RAM1689_REG_OFST          _UINT32_(0x2A64)    /* (TRAM_RAM1689) TrustRAM Offset */
#define TRAM_RAM1690_REG_OFST          _UINT32_(0x2A68)    /* (TRAM_RAM1690) TrustRAM Offset */
#define TRAM_RAM1691_REG_OFST          _UINT32_(0x2A6C)    /* (TRAM_RAM1691) TrustRAM Offset */
#define TRAM_RAM1692_REG_OFST          _UINT32_(0x2A70)    /* (TRAM_RAM1692) TrustRAM Offset */
#define TRAM_RAM1693_REG_OFST          _UINT32_(0x2A74)    /* (TRAM_RAM1693) TrustRAM Offset */
#define TRAM_RAM1694_REG_OFST          _UINT32_(0x2A78)    /* (TRAM_RAM1694) TrustRAM Offset */
#define TRAM_RAM1695_REG_OFST          _UINT32_(0x2A7C)    /* (TRAM_RAM1695) TrustRAM Offset */
#define TRAM_RAM1696_REG_OFST          _UINT32_(0x2A80)    /* (TRAM_RAM1696) TrustRAM Offset */
#define TRAM_RAM1697_REG_OFST          _UINT32_(0x2A84)    /* (TRAM_RAM1697) TrustRAM Offset */
#define TRAM_RAM1698_REG_OFST          _UINT32_(0x2A88)    /* (TRAM_RAM1698) TrustRAM Offset */
#define TRAM_RAM1699_REG_OFST          _UINT32_(0x2A8C)    /* (TRAM_RAM1699) TrustRAM Offset */
#define TRAM_RAM1700_REG_OFST          _UINT32_(0x2A90)    /* (TRAM_RAM1700) TrustRAM Offset */
#define TRAM_RAM1701_REG_OFST          _UINT32_(0x2A94)    /* (TRAM_RAM1701) TrustRAM Offset */
#define TRAM_RAM1702_REG_OFST          _UINT32_(0x2A98)    /* (TRAM_RAM1702) TrustRAM Offset */
#define TRAM_RAM1703_REG_OFST          _UINT32_(0x2A9C)    /* (TRAM_RAM1703) TrustRAM Offset */
#define TRAM_RAM1704_REG_OFST          _UINT32_(0x2AA0)    /* (TRAM_RAM1704) TrustRAM Offset */
#define TRAM_RAM1705_REG_OFST          _UINT32_(0x2AA4)    /* (TRAM_RAM1705) TrustRAM Offset */
#define TRAM_RAM1706_REG_OFST          _UINT32_(0x2AA8)    /* (TRAM_RAM1706) TrustRAM Offset */
#define TRAM_RAM1707_REG_OFST          _UINT32_(0x2AAC)    /* (TRAM_RAM1707) TrustRAM Offset */
#define TRAM_RAM1708_REG_OFST          _UINT32_(0x2AB0)    /* (TRAM_RAM1708) TrustRAM Offset */
#define TRAM_RAM1709_REG_OFST          _UINT32_(0x2AB4)    /* (TRAM_RAM1709) TrustRAM Offset */
#define TRAM_RAM1710_REG_OFST          _UINT32_(0x2AB8)    /* (TRAM_RAM1710) TrustRAM Offset */
#define TRAM_RAM1711_REG_OFST          _UINT32_(0x2ABC)    /* (TRAM_RAM1711) TrustRAM Offset */
#define TRAM_RAM1712_REG_OFST          _UINT32_(0x2AC0)    /* (TRAM_RAM1712) TrustRAM Offset */
#define TRAM_RAM1713_REG_OFST          _UINT32_(0x2AC4)    /* (TRAM_RAM1713) TrustRAM Offset */
#define TRAM_RAM1714_REG_OFST          _UINT32_(0x2AC8)    /* (TRAM_RAM1714) TrustRAM Offset */
#define TRAM_RAM1715_REG_OFST          _UINT32_(0x2ACC)    /* (TRAM_RAM1715) TrustRAM Offset */
#define TRAM_RAM1716_REG_OFST          _UINT32_(0x2AD0)    /* (TRAM_RAM1716) TrustRAM Offset */
#define TRAM_RAM1717_REG_OFST          _UINT32_(0x2AD4)    /* (TRAM_RAM1717) TrustRAM Offset */
#define TRAM_RAM1718_REG_OFST          _UINT32_(0x2AD8)    /* (TRAM_RAM1718) TrustRAM Offset */
#define TRAM_RAM1719_REG_OFST          _UINT32_(0x2ADC)    /* (TRAM_RAM1719) TrustRAM Offset */
#define TRAM_RAM1720_REG_OFST          _UINT32_(0x2AE0)    /* (TRAM_RAM1720) TrustRAM Offset */
#define TRAM_RAM1721_REG_OFST          _UINT32_(0x2AE4)    /* (TRAM_RAM1721) TrustRAM Offset */
#define TRAM_RAM1722_REG_OFST          _UINT32_(0x2AE8)    /* (TRAM_RAM1722) TrustRAM Offset */
#define TRAM_RAM1723_REG_OFST          _UINT32_(0x2AEC)    /* (TRAM_RAM1723) TrustRAM Offset */
#define TRAM_RAM1724_REG_OFST          _UINT32_(0x2AF0)    /* (TRAM_RAM1724) TrustRAM Offset */
#define TRAM_RAM1725_REG_OFST          _UINT32_(0x2AF4)    /* (TRAM_RAM1725) TrustRAM Offset */
#define TRAM_RAM1726_REG_OFST          _UINT32_(0x2AF8)    /* (TRAM_RAM1726) TrustRAM Offset */
#define TRAM_RAM1727_REG_OFST          _UINT32_(0x2AFC)    /* (TRAM_RAM1727) TrustRAM Offset */
#define TRAM_RAM1728_REG_OFST          _UINT32_(0x2B00)    /* (TRAM_RAM1728) TrustRAM Offset */
#define TRAM_RAM1729_REG_OFST          _UINT32_(0x2B04)    /* (TRAM_RAM1729) TrustRAM Offset */
#define TRAM_RAM1730_REG_OFST          _UINT32_(0x2B08)    /* (TRAM_RAM1730) TrustRAM Offset */
#define TRAM_RAM1731_REG_OFST          _UINT32_(0x2B0C)    /* (TRAM_RAM1731) TrustRAM Offset */
#define TRAM_RAM1732_REG_OFST          _UINT32_(0x2B10)    /* (TRAM_RAM1732) TrustRAM Offset */
#define TRAM_RAM1733_REG_OFST          _UINT32_(0x2B14)    /* (TRAM_RAM1733) TrustRAM Offset */
#define TRAM_RAM1734_REG_OFST          _UINT32_(0x2B18)    /* (TRAM_RAM1734) TrustRAM Offset */
#define TRAM_RAM1735_REG_OFST          _UINT32_(0x2B1C)    /* (TRAM_RAM1735) TrustRAM Offset */
#define TRAM_RAM1736_REG_OFST          _UINT32_(0x2B20)    /* (TRAM_RAM1736) TrustRAM Offset */
#define TRAM_RAM1737_REG_OFST          _UINT32_(0x2B24)    /* (TRAM_RAM1737) TrustRAM Offset */
#define TRAM_RAM1738_REG_OFST          _UINT32_(0x2B28)    /* (TRAM_RAM1738) TrustRAM Offset */
#define TRAM_RAM1739_REG_OFST          _UINT32_(0x2B2C)    /* (TRAM_RAM1739) TrustRAM Offset */
#define TRAM_RAM1740_REG_OFST          _UINT32_(0x2B30)    /* (TRAM_RAM1740) TrustRAM Offset */
#define TRAM_RAM1741_REG_OFST          _UINT32_(0x2B34)    /* (TRAM_RAM1741) TrustRAM Offset */
#define TRAM_RAM1742_REG_OFST          _UINT32_(0x2B38)    /* (TRAM_RAM1742) TrustRAM Offset */
#define TRAM_RAM1743_REG_OFST          _UINT32_(0x2B3C)    /* (TRAM_RAM1743) TrustRAM Offset */
#define TRAM_RAM1744_REG_OFST          _UINT32_(0x2B40)    /* (TRAM_RAM1744) TrustRAM Offset */
#define TRAM_RAM1745_REG_OFST          _UINT32_(0x2B44)    /* (TRAM_RAM1745) TrustRAM Offset */
#define TRAM_RAM1746_REG_OFST          _UINT32_(0x2B48)    /* (TRAM_RAM1746) TrustRAM Offset */
#define TRAM_RAM1747_REG_OFST          _UINT32_(0x2B4C)    /* (TRAM_RAM1747) TrustRAM Offset */
